Revit 2027 API
BuiltInFailures.InfillFailures.InfillNoSlopeGlazing Property
 Could not change type due to highlighted infilling element. 'Sloped glazing' infills are not allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InfillNoSlopeGlazing { get; }
Public Shared ReadOnly Property InfillNoSlopeGlazing As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InfillNoSlopeGlazing {
	FailureDefinitionId^ get ();
}
static member InfillNoSlopeGlazing : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.InfillFailures Class
Autodesk.Revit.DB Namespace